; domain
(define (domain blocks)
    (:requirements
        :strips :equality :typing
        :universal-preconditions
        :conditional-effects
    )
    (:types physob)
    (:predicates 
        (ontable ?x - physob)
        (clear ?x - physob)
        (on ?x ?y - physob))
    (:action move
        :parameters (?x ?y - physob)
        :precondition(
            and (clear ?x) (clear ?y) (not (= ?x ?y))
        )
        :effect(
            and (forall (?z - physob)
                    (when (on ?x ?z) (
                        and (not (on ?x ?z)) (clear ?z)
                    ))
                ) 
                (not (clear ?y)) (on ?x ?y) (not (ontable ?x))
        )
    )
    (:action moveToTable
        :parameters (?x - physob)
        :precondition(
            and (clear ?x) (not (ontable ?x))
        )
        :effect( and (ontable ?x) )
    )
)

; problem
(define (problem prob)
    (:domain blocks)
    (:objects A B C D E F - physob)
    (:init 
        (clear A) (on A B) (on B C) (ontable C) (ontable D)
        (ontable F) (on E D) (clear E) (clear F)
    )
    (:goal (
        and (clear F) (on F A) (on A C) (ontable C) (clear E) (on E B)
            (on B D) (ontable D) )
    )
)

; plan
1. (move a f)
   deleted: (on a b) (clear f)
   added: (clear b) (on a f)
   goals met: 3 of 8
2. (move b e)
   deleted: (on b c) (clear e)
   added: (clear c) (on b e)
   goals met: 2 of 8
3. (move a c)
   deleted: (on a f) (clear c)
   added: (clear f) (on a c)
   goals met: 4 of 8
4. (move b a)
   deleted: (on b e) (clear a)
   added: (clear e) (on b a)
   goals met: 5 of 8
5. (move e f)
   deleted: (on e d) (clear f)
   added: (clear d) (on e f)
   goals met: 4 of 8
6. (move b d)
   deleted: (on b a) (clear d)
   added: (clear a) (on b d)
   goals met: 5 of 8
7. (move e b)
   deleted: (on e f) (clear b)
   added: (clear f) (on e b)
   goals met: 7 of 8
8. (move f a)
   deleted: (clear a) (ontable f)
   added: (on f a)
   goals met: 8 of 8
